Revit 2027 API
SymbolTypeId.Shaku Property
 Symbol 尺, indicating unit Shaku.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Shaku { get; }
Public Shared ReadOnly Property Shaku As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Shaku {
	ForgeTypeId^ get ();
}
static member Shaku : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SymbolTypeId Class
Autodesk.Revit.DB Namespace